### Heroes Of Pymoli Data Analysis

-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [4]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
file_to_load = "/Users/chrissy/Documents/CG_Data_Science/Data-Science-Assignments/course_material/week_04/homework/Resources/purchase_data.csv"

purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [28]:
purchase_data_df = pd.DataFrame(purchase_data)

unique_SNs = purchase_data_df["SN"].unique()

unique_SNs_df = pd.DataFrame(unique_SNs)
unique_SNs_df

Total_Players = 575+1
print("total players:", Total_Players)

total players: 576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [54]:
unique_items = purchase_data_df["Item Name"].unique()
unique_items_df = pd.DataFrame(unique_items)
num_unique_items = 178+1
num_unique_items

avg_price = purchase_data_df["Price"].mean()
avg_price

num_purchases = 779 + 1
num_purchases

total_revenue = purchase_data_df["Price"].sum()
total_revenue

purchase_analysis = {"# of Unique Items": num_unique_items, "Avg Price": avg_price, "# of Purchases": num_purchases,
                    "Total Revenue": total_revenue}
purchase_analysis_df = pd.DataFrame(purchase_analysis, index=[0], columns=["# of Unique Items", "Avg Price", "# of Purchases",
                    "Total Revenue"])
print(purchase_analysis_df)

   # of Unique Items  Avg Price  # of Purchases  Total Revenue
0                179   3.050987             780        2379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [62]:
print(purchase_data_df["Gender"].value_counts())
gender_percent = (purchase_data_df["Gender"].value_counts())/780*100
print(gender_percent)

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64
Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [81]:
gender_group_df = purchase_data_df.groupby("Gender")
gender_group_df.count()

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [82]:
gender_group_df.mean()

                       Purchase ID        Age    Item ID     Price
Gender
Female                  379.380531  21.345133  85.477876  3.203009
Male                    392.516871  22.917178  93.524540  3.017853
Other / Non-Disclosed   334.600000  24.200000  80.800000  3.346000

In [83]:
gender_group_df.count()*gender_group_df.mean()

                           Age  Item ID  Item Name    Price  Purchase ID  SN
Gender
Female                  2412.0   9659.0        NaN   361.94      42870.0 NaN
Male                   14942.0  60978.0        NaN  1967.64     255921.0 NaN
Other / Non-Disclosed    363.0   1212.0        NaN    50.19       5019.0 NaN

In [87]:
gender_purchase_summary = {"Purchase Count": [113, 652, 15], "Avg Purchase Price": [3.20, 3.02, 3.35],
                          "Total Purchase Value":[361.94, 1967.64, 50.19]}

print(gender_purchase_summary)

gps_df = pd.DataFrame(gender_purchase_summary, index=["Female", "Male", "Other/non-disclosed"])
gps_df

{'Purchase Count': [113, 652, 15], 'Avg Purchase Price': [3.2, 3.02, 3.35], 'Total Purchase Value': [361.94, 1967.64, 50.19]}

                     Purchase Count  Avg Purchase Price  Total Purchase Value
Female                          113                3.20                361.94
Male                            652                3.02               1967.64
Other/non-disclosed              15                3.35                 50.19

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [91]:
age_bins = [1, 21, 33, 42, 100]
age_labels = ["youth", "less young", "less old", "old"]

pd.cut(purchase_data_df["Age"], age_bins, labels=age_labels)

0           youth
1        less old
2      less young
3      less young
4      less young
          ...
775         youth
776         youth
777         youth
778         youth
779    less young
Name: Age, Length: 780, dtype: category
Categories (4, object): ['youth' < 'less young' < 'less old' < 'old']

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80